---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimIsreporting
source: html/0237e9c0-01f1-a332-2be2-90436f7bc99c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimIsreporting Property

"Is Reporting"

## Syntax (C#)
```csharp
public static ForgeTypeId DimIsreporting { get; }
```